Тестовая_база_ERP_14/src/Documents/АГ_ПлановыйКоэффицентЗапасов/АГ_ПлановыйКоэффицентЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_ПлановыйКоэффицентЗапасов</name>
  <registerRecords>InformationRegister.АГ_ПлановыйКоэффициентЗапасов</registerRecords>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.АГ_ТипыДокументаПлановыйКоэффициентЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.CRM_ПериодыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КоэффициентыЗапасов</name>
    <attributes>
      <name>СводнаяНоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>CatalogRef.CRM_ПериодыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяемыйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/InformationRegisters/АГ_ПлановыйКоэффициентЗапасов/АГ_ПлановыйКоэффициентЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АГ_ПлановыйКоэффициентЗапасов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.АГ_ТипыДокументаПлановыйКоэффициентЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СводнаяНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>CatalogRef.CRM_ПериодыПланирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/АГ_ТипыДокументаПлановыйКоэффициентЗапасов/АГ_ТипыДокументаПлановыйКоэффициентЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_ТипыДокументаПлановыйКоэффициентЗапасов</name>
  <enumValues>
    <name>Базовый</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйОСН</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйХРН</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйИнвестиция</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/АГ_ПлановыйКоэффицентЗапасов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АГ_ПлановыйКоэффициентЗапасов.Записывать = Истина;
	Движения.АГ_ПлановыйКоэффициентЗапасов.Очистить();
	Для Каждого ТекСтрокаКоэффициентыЗапасов Из КоэффициентыЗапасов Цикл
		Движение = Движения.АГ_ПлановыйКоэффициентЗапасов.Добавить();
		Движение.ТипДокумента = ТипДокумента;
		Движение.Склад = Склад;
		Движение.СводнаяНоменклатурнаяГруппа = ТекСтрокаКоэффициентыЗапасов.СводнаяНоменклатурнаяГруппа;
		Движение.Месяц = ТекСтрокаКоэффициентыЗапасов.Месяц;
		Движение.ЗначениеКоэффициента = ТекСтрокаКоэффициентыЗапасов.ЗначениеКоэффициента;
		Движение.ПериодДействия = ПериодДействия;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	ТипДокумента = Перечисления.АГ_ТипыДокументаПлановыйКоэффициентЗапасов.Базовый;
	
КонецПроцедуры
	
#КонецОбласти
